In [39]:
import pandas as pd

In [40]:
data = [[1,2,3], [4,5,6], [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [41]:
list('321')

['3', '2', '1']

In [42]:
df = pd.DataFrame(data, list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [43]:
df.sort_index(inplace = True, axis = 1)

In [44]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [45]:
df.sort_index(inplace = True)

In [46]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [47]:
df.sort_values(by = ['X','Y'], inplace = True)

In [48]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [49]:
df.sort_values(by = '3', axis =1, inplace = True)

In [50]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9